In [38]:
import pandas as pd

In [53]:
# df = pd.DataFrame({'col1':[1,2,3,4], 
#                    'col2':[444,555,666,444], 
#                    'col3':['abc','def','ghi','xyz']})

In [67]:
df = pd.DataFrame({'col1': [1,2,3,4], 
                   'col2': [444,555,666,444], 
                   'col3': 'Charles Arthur David Bill'.split()})

In [40]:
df

   col1  col2     col3
0     1   444  Charles
1     2   555   Arthur
2     3   666    David
3     4   444     Bill

# Unique Values

In [41]:
#unique values in col2
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [42]:
#number of unique values in col2
len(df['col2'].unique())

3

In [43]:
#number of unique values in col2
df['col2'].nunique()

3

In [44]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Select Data

In [45]:
df[df['col1']>1]

   col1  col2    col3
1     2   555  Arthur
2     3   666   David
3     4   444    Bill

# Apply Function

In [46]:
def times2(x):
    return 2*x

In [47]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [48]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [54]:
df['col3'].apply(len)

0    7
1    6
2    5
3    4
Name: col3, dtype: int64

In [64]:
df['col1'].sum()

10

# Delete column or row

In [65]:
del df['col1']

In [66]:
df

   col2     col3
0   444  Charles
1   555   Arthur
2   666    David
3   444     Bill

In [73]:
df.drop('col1', axis=1)    #won't effect df unless inplace=True

   col2     col3
0   444  Charles
1   555   Arthur
2   666    David
3   444     Bill

In [75]:
df.drop(2)    #won't effect df unless inplace=True

   col1  col2     col3
0     1   444  Charles
1     2   555   Arthur
3     4   444     Bill

# Get column and index Names

In [49]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [50]:
list(df.columns)

['col1', 'col2', 'col3']

In [51]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [52]:
list(df.index)

[0, 1, 2, 3]

# Sorting

In [55]:
df.sort_values('col2')

   col1  col2     col3
0     1   444  Charles
3     4   444     Bill
1     2   555   Arthur
2     3   666    David

In [56]:
df.sort_values('col3')

   col1  col2     col3
1     2   555   Arthur
3     4   444     Bill
0     1   444  Charles
2     3   666    David

# Pivot Table

In [58]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df_2 = pd.DataFrame(data)

In [59]:
df_2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [63]:
pivot = df_2.pivot_table(values='D', index=['A', 'B'], columns='C')
# multi-level index:
#     level_1 = 'A'
#     level_2 = 'B'

pivot

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Check for Null Value and Fill

In [62]:
pivot.isnull()

C            x      y
A   B
bar one  False  False
    two   True  False
foo one  False  False
    two  False   True

In [76]:
pivot.fillna(100)

C            x      y
A   B
bar one    4.0    1.0
    two  100.0    5.0
foo one    1.0    3.0
    two    2.0  100.0